def askData():                   # Функція в якій відбувається введення даних користувачем
    a = int(input("Введіть a: ")) # Користувач вводить дані типу int
    b = int(input("Введіть b: "))
    op = input("Введіть операцію [+ - * / ]: ") # Ввід операції
    return a, b, op

def add(a, b):                   # Функція в якій відбувається додвання
    c = a + b
    return c

def rem(a, b):                   # Функція в якій відбувається віднімання
    c = a - b
    return c

def mult(a,b):                   # Функція в якій відбувається множення
    c = a * b
    return c

def div(a,b):                    # Функція в якій відбуваєтсья ділення
    if a == 0 or b == 0:         # Якщо одне зі значень дорівнює 0 то ділення неможливе
        c = "Операція неможлива"
        return c
    else:                          
        c = a / b
        return c

a, b, op = askData()             # Значення отримуються з функції

match op:                        # Конструкція match
    case "+":                    # Якщо значення op + то виконується даний випадок
        result = add(a, b)
        print(result)
    case "-":                    # Якщо значення op - то виконується даний випадок
        result = rem(a, b)
        print(result)
    case "*":                    # Якщо значення op * то виконується даний випадок
        result = mult(a,b)
        print(result)
    case "/":                    # Якщо значення op / то виконується даний випадок
        result = div(a,b)
        print(result)
    case _:                      # Якщо значення op не відповідає попереднім випадкам то виконується даний випадок.
        print("Невірно вказані дані")