def askNumb():                   # Функція в якій відбувається введення даних користувачем
    a = int(input("Введіть a: ")) # Користувач вводить дані типу int
    b = int(input("Введіть b: "))
    c = int(input("Введіть c: "))
    return a, b, c

def calcDisc(a, b, c):           # Функція в якій відбувається обрахунок дискримінанту
    D = (b**2-(4*a*c))           # Обчислення дискримінанту **-піднесення до ступеня 
    return D

def calcX(Disc):            # Функція обрахунку коренів
    if Disc > 0:            # Умовний оператор if. Якщо дискримінант більше 0, то він має два корені
        x1 = (-b + (Disc**0.5))/2*a
        x2 = (-b - (Disc**0.5))/2*a
        return x1, x2
    elif Disc == 0:        # Якщо дискримінант дорівнює 0, то він має один корінь
        x = (-b/2*a)
        return x
    else:                  # Якщо дискримінант менше 0, то він не має коренів
        x="Квардратне рівняння коренів не має"
        return x

a, b, c = askNumb()     # Значення отримуються з функції
Disc = calcDisc(a, b, c) # Значення дискримінанту обчислюється використовуючи значення, отримані з попередньої функції

if Disc > 0:            # Результати беруться з функцыъ обрахунку коренів квадратного рівняння
    x1, x2 = calcX(Disc)   
    print(x1, x2)
elif Disc == 0:
    result = calcX(Disc)
    print(result)
else:
    result = calcX(Disc)
    print(result) 