def askData():                   # Функція в якій відбувається введення даних користувачем
    num = int(input("Введіть число, щоб дізнатися його позицію: "))  # Користувач вводить дані типу int
    return num

def num_pos(num_list,num):          # Функція в якій відбувається порівняння значень списку і значення числа, яке ввів користувач
    pos = 0                         
    for elem in num_list:           # Цикл який проходить через усі значення списку
        if num > elem:              # Якщо значення числа, яке ввів користувач більше значення елементу відсортованого списку, то позиция збільшується на 1
           pos = pos + 1
        else:                       # Якщо значення числа не буде більшм за значення елементу відсортованого списку, то цикл зупиняється і значення pos повертається
            break
    return pos 
        
num_list = [-5, 5, 0, -10, 10]
num_list.sort()                     # Використовую для сортування
print("Список складається з:", num_list)

num = askData()
pos = num_pos(num_list,num)                                      # Значення позиції отримується з функції
print("Позиція нового елементу по відношеню до списку: ", pos)