def askData():                   # Функція в якій відбувається введення даних користувачем
    while True:             # Цикл, який працює доки не буде вказано дані типу float
        try:                     # try використовується для відстеження виняткових ситуацій.
            a = float(input("Введіть a: ")) # Користувач вводить дані типу float, щоб використувати в операціях не цілі числа
        except ValueError:       # except використовується для виконання інструкцій у випадку виняткової ситуації. В даному випадку ValueError
            print(" Помилка, значення a - не число ")
        else:
            break
    return a

def add(a, b):                   # Функція в якій відбувається додвання
    a = a + b
    return a

def rem(a, b):                   # Функція в якій відбувається віднімання
    a = a - b
    return a

def mult(a,b):                   # Функція в якій відбувається множення
    a = a * b
    return a

def div(a,b):                    # Функція в якій відбуваєтсья ділення                
    try:
        a = a / b
    except ZeroDivisionError:           # Якщо значення b = 0, то буде виняткова ситуація "ZeroDivisionError", тоді буде повідомлення, що операція неможлива
        print(" Помилка, ділення на нуль неможливе")
    return a                     # Значення а або не зміниться (якщо b = 0), або буде поділенно на b.

def calc(a):  # Функція в якій відбувається обрахунки калькулятора
    while True:
            op = input("Введіть операцію [+ - * / ], або ex, для того щоб завершити операцію: ")    #  Ввід операції, якщо значення буде ex то це припиняє цикл, якщо інше то цикл продовжується
            if op == "ex":
                return a  # Якщо значення op, буде ex то повертаэ значення a і зупиняє цикл
                break
            else:
                while True:
                    try:
                        b = float(input("Введіть b: ")) # Користувач вводить дані типу float, щоб використувати в операціях не цілі числа
                    except ValueError:
                        print(" Помилка, значення b - не число ")
                    else:
                        break
                match op:                        # Конструкція match
                    case "+":                    # Якщо значення op + то виконується даний випадок
                        a = add(a,b)
                    case "-":                    # Якщо значення op - то виконується даний випадок
                        a = rem(a,b)
                    case "*":                    # Якщо значення op * то виконується даний випадок
                        a = mult(a,b)
                    case "/":                    # Якщо значення op / то виконується даний випадок                
                        a = div(a,b)
                    case _:                      # Якщо значення op не відповідає попереднім випадкам то виконується даний випадок.
                        print("Невірно вказані дані")
            print("Значення a на даний момент: ", a) # Після виконання будь-якої операції, окрім виходу, виводить проміжне значення a
            

a = askData() # Значення отримуються з функції
result = calc(a)
print("Результат обчислень: ", result)