def askNumb():                   # Функція в якій відбувається введення даних користувачем
    a = int(input("Введіть a: ")) # Користувач вводить дані типу int
    b = int(input("Введіть b: "))
    c = int(input("Введіть c: "))
    return a, b, c

def calcDisc(a, b, c):           # Функція в якій відбувається обрахунок дискримінанту
    D = (b**2-(4*a*c))           # Обчислення дискримінанту **-піднесення до ступеня 
    return D
    
num1, num2, num3 = askNumb()     # Значення num1-3 отримуються з функції
Disc = calcDisc(num1, num2, num3) # Значення дискримінанту обчислюється використовуючи значення, отримані з попередньої функції

print("Дискримінант функції = ", Disc)