text1 = "    DanKoz     " # Функція strip використовується для видалення символів на початку і кінці строки. 
text2 = "--oo--Good morning---o--"
print(text1.strip()) # Якщо в дужках функціїї не вказано символи, то приймається базове значення а саме пробіл.
print(text2.strip("-o")) # Якщо в дужках вказано символи, то вони видаляються на початку і кінці строки.
text3 = "tOdAy Is a GoOd day"
print(text3.capitalize()) # Функція capitalize використовується для повернення строки з першим символом у верхньому регістрі, а інші символи у нижньому. 
text4 = "fIRST tITLE"
print(text4.title()) # Функція title повертає строку з перший символ у верхньому регістрі для кожного слова, а інші символи у нижньому.
text5 = "mix lethal"
print(text5.upper()) # Функція upper використовується для переведення усіч символів у верхній регістр
text6 = "MIN MAX"
print(text6.lower()) # Функція lower використовується для переведення усіх символів у нижній регістр